'''Користувачем  вводяться  з  клавіатури  5  цілих  чисел,  при  цьому враховуються лише натуральні числа (цілі додатні).Необхідно з’ясувати, які цифри –парні чи непарні –зустрічалися частіше в даних десяти числах.'''
i, odd, even = 0, 0, 0;
while (i < 5):
	try:
		number = int(input("Введите целое число:"));
	except ValueError:
		print('Вводить можно только числа');
		continue;
	else:
		if (number % 2 == 0):
			even += 1;
		else:
			odd += 1;
		i += 1;

if (even > odd and ( even > 1 or odd > 1)):
	print('Четных чисел больше, их %i' % even);
else:
	print('Нечетных чисел больше, их%i' % odd);